backend/app/controllers/api/listings_controller.rb

SELECT "listings".* FROM "listings"
---
  def index
    # @listings = Listing.apply_filters(params[:category_id], params[:make_id], params[:model_id], params[:shop_id], params[:min_price], params[:max_price])
    @listings = Listing.all